emacs-config/config.org
#+titlMy Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ~/Projects/sys-config/emacs-config/init.el
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el
* Emacs Key Auth Issue
- Download the *.tar file (gnu-elpa-keyring-update package) [[https://elpa.gnu.org/packages/gnu-elpa-keyring-update.html][here]].
- Run "M-:" + "package-install-file" and provide the path to the downloaded *.tar file.
* Setup Configuration File
** set path to the current file

Provide abs path to this *.org file (important for auto-tangle-on-save).

#+begin_src emacs-lisp
(defvar mma/org-config-path "~/Projects/sys-config/emacs-config/config.org")
#+end_src

#+RESULTS:
: mma/org-config-path

** font sizes

Set font sizes (probably it depends on your dpi).

#+begin_src emacs-lisp
(defvar mma/default-font-size 180)
(defvar mma/documents-font-size 210)
#+end_src

* Setup Packages & Repos
#+begin_src emacs-lisp
(require 'package)
(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("gnu" . "https://elpa.gnu.org/packages/")))
(package-initialize)

;; Refresh the package list if it is not already downloaded
(unless package-archive-contents
  (package-refresh-contents))

;; Install use-package if it's not already installed
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

;; Load use-package
(require 'use-package)
(setq use-package-always-ensure t)
#+end_src

#+RESULTS:
: t

* UI Configuration
** basic behavior

#+begin_src emacs-lisp
;remove the startup message (make emacs welcome screen disapear)
(setq inhibit-startup-message t)
;disable scroll bar
(scroll-bar-mode -1)
;disable toolbar
(tool-bar-mode -1)
;disable tooltip
(tooltip-mode -1)
;set some margins
(set-fringe-mode 15)
;disable menu bar
(menu-bar-mode -1)
;instead of the bell sound set visible bell (as blinks)
(setq visible-bell t)
;disable line numbers for some modes (like terminal and org-mode)
(dolist (mode '(org-mode-hook
		term-mode-hook
		shell-mode-hook
              treemacs-mode-hook
		eshell-mode-hook))
  (add-hook mode(lambda() (display-line-numbers-mode 0))))
#+end_src

#+RESULTS:
** eshell customization

#+begin_src emacs-lisp
(use-package eshell-prompt-extras
  :ensure t
  :after eshell
  :config
  (with-eval-after-load 'esh-opt
    (require 'eshell-prompt-extras)
    (setq eshell-highlight-prompt t
          eshell-prompt-function 'epe-theme-lambda)))
#+end_src

#+RESULTS:
: t

** full screen on start

#+begin_src emacs-lisp
(add-to-list 'default-frame-alist '(fullscreen . fullboth))
#+end_src

* Themes & Fonts
** fonts

#+begin_src emacs-lisp 
(set-face-attribute 'default nil :font "Fira Code Retina" :height mma/default-font-size)
(set-face-attribute 'fixed-pitch nil :font "Fira Code Retina" :height mma/default-font-size)
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height mma/documents-font-size :weight 'regular)
#+end_src

#+RESULTS:

** doom-themes

#+begin_src emacs-lisp
(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-badger t)
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

#+RESULTS:
: t

** doom-modeline

#+begin_src emacs-lisp
(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom (doom-modeline-height 50))

(setq doom-modeline-icon t)
(setq doom-modeline-major-mode-icon t)
(setq doom-modeline-major-mode-color-icon t)
#+end_src

#+RESULTS:
: t

** all-the-icons

#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src

#+RESULTS:

* Navigation
** ivy

#+begin_src emacs-lisp
(use-package ivy
  :diminish
  :config
  (ivy-mode 1)
  :bind (("C-s" . swiper) ;searching in real time!
         :map ivy-minibuffer-map ;C+vim-like key bindings in the minibuffer
         ("TAB" . ivy-alt-done) 	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map ;same hear
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill)))
#+end_src

#+RESULTS:
: ivy-reverse-i-search-kill

** ivy-rich

#+begin_src emacs-lisp
(use-package ivy-rich
  :init
  (ivy-rich-mode t))
#+end_src

#+RESULTS:

** ivy keybindings

#+begin_src emacs-lisp
(global-set-key (kbd "C-x C-f") 'counsel-find-file)
(global-set-key (kbd "C-x C-b") 'counsel-switch-buffer)
(global-set-key (kbd "M-x") 'counsel-M-x)
(global-set-key (kbd "C-x b") 'counsel-ibuffer)
#+end_src

#+RESULTS:
: counsel-ibuffer

** which-key

#+begin_src emacs-lisp
;Hint: use C-h n and C-h p to navigate the pop-up with key bindings
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))
#+end_src

#+RESULTS:
: t

** counsel 

#+begin_src emacs-lisp
(use-package counsel
  :bind (
	 :map minibuffer-local-map
	 ("C-r" . "counsel-minibuffer-history")))
#+end_src

#+RESULTS:
: counsel-minibuffer-history

** helpful

#+begin_src emacs-lisp
(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-varuable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+end_src

#+RESULTS:
: helpful-key

* Vim Key Bindings
** evil

#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-i-jump nil)
  (setq evil-want-C-u-scroll t)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)
  ;; Use visual line motions even outside of visual-line-mode buffers
  ;; If the cursor is at the top / bottom of the current view it will go to the previous / next line
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
#+end_src

#+RESULTS:
: t

** evil-collection

#+begin_src emacs-lisp
;;There is a variable evil-collection-mode-list, that contains the list of all modes
;;to which evil-collection defines key-bindings, if some bindings are not satisfying,
;;just remove the mode from the evil-collection-mode-list.
(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))
#+end_src

#+RESULTS:
: t

* Custom Namespace

#+begin_src emacs-lisp
(use-package general
  :config
  (general-evil-setup t)

  (general-create-definer mma/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (mma/leader-keys
    "tt" '(counsel-load-theme :which-key "choose theme")
    "ts" '(hydra-text-scale/body :which-key "scale text")))
#+end_src

#+RESULTS:
: t

* Org Mode
** org-mode setup

#+begin_src emacs-lisp
;; Basic indentation and line-breaking behavior
(defun mma/org-mode-setup ()
  (setq org-adapt-indentation t)
  (org-indent-mode t)
  (variable-pitch-mode 1)
  (visual-line-mode 1))
#+end_src

#+begin_src emacs-lisp
;; Replace list hyphen with dot
(defun mma/org-bullet-list-setup ()
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•")))))))
#+end_src

#+RESULTS:
: mma/org-font-setup

