emacs-config/config.org
** org

#+begin_src emacs-lisp
(use-package org
  :hook (org-mode . mma/org-mode-setup)
  :hook (org-mode . mma/org-bullet-list-setup)
  :config
  (setq org-ellipsis " ▾"
	org-hide-emphasis-markers nil) ;can hide the * for bold text, ~ for the code, ... it can get messy
  (setq org-agenda-start-with-log-mode t) ;it will present a log of all tasks I am working today
  (setq org-log-done 'time) ;it will track the time, when the task was switched to "DONE" (C-c C-t)
  (setq org-log-into-drawer t) ;it will show the log of the task state evolution (in org-agenda-list)
  (setq org-agenda-files
	'("~/Projects/sys-config/emacs-config/org-files/tasks.org"))

  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

#+RESULTS:
| (lambda nil (add-hook 'after-save-hook #'mma/org-babel-tangle-config)) | org-tempo-setup | org-bullets-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | mma/org-mode-visual-fill | mma/org-font-setup | mma/org-mode-setup | (lambda nil (display-line-numbers-mode 0)) |

** org-bullets

#+begin_src emacs-lisp
(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  ;;font size adjustment to the heading levels + set font to cantarell, so the documents look like documents
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 0.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)

    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))))
#+end_src

#+RESULTS:

** visual-fill-column

#+begin_src emacs-lisp
(defun mma/org-mode-visual-fill ()
   (setq visual-fill-column-center-text t)
   (setq visual-fill-column-extra-text-width '(30 . 30))
   (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . mma/org-mode-visual-fill))
#+end_src

#+RESULTS:
| mma/org-mode-visual-fill | org-bullets-mode | mma/org-font-setup | mma/org-mode-setup | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | (lambda nil (display-line-numbers-mode 0)) |

** org-babel

#+begin_src emacs-lisp
(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp .t)
    (python . t)))
;; unix like config *.ini files syntax support
(push '("conf-unix" . conf-unix) org-src-lang-modes)
;; python command for evaluating python code blocks
(setq org-babel-python-command "/usr/bin/python3.10")
#+end_src

#+RESULTS:
: /usr/bin/python3

** org-tempo code block temlates

This allows for the shortcuts for the source-code block insertion. For example to insert python source code block, just insert "<py" and then TAB.

#+begin_src emacs-lisp
(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("conf" . "src conf-unix"))
#+end_src

#+RESULTS:
: ((conf . src conf-unix) (py . src python) (el . src emacs-lisp) (sh . src shell) (a . export ascii) (c . center) (C . comment) (e . example) (E . export) (h . export html) (l . export latex) (q . quote) (s . src) (v . verse))
* Dev
** rainbow-delimiters

#+begin_src emacs-lisp
;If any programming language mode starts (prog-mode), enable rainbow mode
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode |

** projectile

#+begin_src emacs-lisp
;Projectile key-bindings can be found with C-c p (as I have set the projectile-command-map below)
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap ;Allows to easily create a key-binding for the projectile package
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects")))
  (setq projectile-switch-project-action #'projectile-dired))
#+end_src

** projectile-counsel

#+begin_src emacs-lisp
;After C-c p p and hitting M-o there are many actions, that can be invoked on a project
(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src

** magit

#+begin_src emacs-lisp
(use-package magit
  :custom
  ;; display diff in the same window
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
#+end_src

** lsp-mode (language servers)

#+begin_src emacs-lisp
;; show nav at the top of each project file
(defun mma/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . mma/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :init
  :custom (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy
  :commands lsp-ivy-workspace-symbol)
#+end_src

#+RESULTS:

Usefull tips:
- To use lsp-mode you need to install the langauge server first (for any language, like python, C, C++, Rust, ...)
- Next, you can try the following functionalities
  - "completion-at-point" is an ivy-like autocompletion (navigate like in any ivy buffer, TAB to confirm currently selected)
  - when cursor is on the function / variable, documentation is displayed in the minibuffer, if the function is overloaded, you can use "M-n", M-p" to switch to different function implementation docs
  - "C-c l g" - lsp go-to
  - "C-c l r" -lsp refactor menu
  - "flymake-show-diagnostic-buffer" - shows the diagnostics buffer for the currently opened buffer
  - for highlited line of code, if something is wrong (for example variable is never used), you can go ther with the cursor, the bulb symbol will appear in the minibuffer, press "C-c l a" to get the menu of the code actions, that can fix the problem
  - "C-c l = =" - "lsp-format-buffer" it will format the file (however probably *there are better options to format the code created as dedicated packages / linters for specific languages*)
  - "lsp-treemacs-symbols" command pops up the cirrent buffer code structure tree (it can be used to easily navigate throught the code)
  - "lsp-treemacs" just opens the dir tree (after specifying the tree root)
** company-mode (for nice autocompletion)

#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (prog-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
  
(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** python-dev 
*** python-mode & lsp-mode configuration

#+begin_src emacs-lisp
;; Automatically use the correct Python interpreter from the activated virtual environment
(defun mma/lsp-set-python-executable ()
  (when (bound-and-true-p pyvenv-virtual-env)
    (setq lsp-pylisp-python-executable-cmd
          (concat pyvenv-virtual-env "/bin/python"))))

;; configure python mode
(use-package python-mode
  :ensure nil
  :hook
  (python-mode . lsp-deferred)
  :custom
  (python-shell-interpreter "/usr/bin/python3.11")
  :config
  (add-hook 'python-mode-hook #'my/lsp-set-python-executable))
#+end_src

#+RESULTS:
| blacken-mode | lsp-deferred | doom-modeline-env-setup-python |

*** language server settings

#+begin_src emacs-lisp
;; force lsp-mode to run global pylsp server each time
(setq lsp-pylsp-server-command "pylsp")

;; use local python interpreter from the selected .venv
(setq lsp-pylsp-python-executable-cmd "python")

(use-package flycheck
  :config
  (when (bound-and-true-p pyvenv-virtual-env)
    (setq flycheck-python-pylint-executable (concat pyvenv-virtual-env "/bin/pylint"))
    (setq flycheck-python-flake8-executable (concat pyvenv-virtual-env "/bin/flake8"))))

(use-package blacken
  :hook (python-mode . blacken-mode))

(use-package py-isort
  :hook (before-save . py-isort-before-save))

(use-package flycheck-pycheckers
  :after flycheck
  :init (setq flycheck-pycheckers-checkers '(pylint))
  :hook (flycheck-mode . flycheck-pycheckers-setup))

#+end_src

#+RESULTS:
| flycheck-pycheckers-setup | flycheck-mode-set-explicitly | doom-modeline-update-flycheck-text | doom-modeline-update-flycheck-icon |

*** pyvenv

#+begin_src emacs-lisp
;; virtual envirnoment management
(use-package pyvenv
  :config
  (pyvenv-mode 1)
  (setenv "WORKON_HOME" "~/Projects/venvs")
)
#+end_src

* TODO Tramp mode
* Tangling Configuration File
** Tangle All Code Blocks

Apply the same configuration to every block.

#+begin_src org :tangle no
#+PROPERTY: header-args:emacs-lisp :tangle <file_path> :mkdirp yes
#+end_src

Command above will allow us to set auto-tangle each emacs-lisp code block in this file to the same file every time the "org-babel-tangle" command is executed in this buffer. Of course this approach require to run this command every time, when any emacs-lisp code block has been changed, so it is not the best idea. 

The ~:mkdirp yes~ is allowing to create all the parent directories (if they do not exist already) to match the specified filepath.

** Tangle Configuration File

#+begin_src emacs-lisp :tangle no
(org-babel-tangle)
(org-babel-tangle-file "~/.emacs.d/init.el")
#+end_src

#+RESULTS:

Those two commands above will tangle all the files to the file with a given filepath.

