emacs-config/init.el
  (setq org-ellipsis " ▾"
	org-hide-emphasis-markers nil) ;can hide the * for bold text, ~ for the code, ... it can get messy
  (setq org-agenda-start-with-log-mode t) ;it will present a log of all tasks I am working today
  (setq org-log-done 'time) ;it will track the time, when the task was switched to "DONE" (C-c C-t)
  (setq org-log-into-drawer t) ;it will show the log of the task state evolution (in org-agenda-list)
  (setq org-agenda-files
	'("~/Projects/sys-config/emacs-config/org-files/tasks.org"))

  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))

(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

  ;;font size adjustment to the heading levels + set font to cantarell, so the documents look like documents
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 0.0)
                  (org-level-5 . 1.0)
                  (org-level-6 . 1.0)
                  (org-level-7 . 1.0)

    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))))

(defun mma/org-mode-visual-fill ()
   (setq visual-fill-column-center-text t)
   (setq visual-fill-column-extra-text-width '(30 . 30))
   (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . mma/org-mode-visual-fill))

(org-babel-do-load-languages
  'org-babel-load-languages
  '((emacs-lisp .t)
    (python . t)))
;; unix like config *.ini files syntax support
(push '("conf-unix" . conf-unix) org-src-lang-modes)
;; python command for evaluating python code blocks
(setq org-babel-python-command "/usr/bin/python3.10")

(require 'org-tempo)

(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
(add-to-list 'org-structure-template-alist '("py" . "src python"))
(add-to-list 'org-structure-template-alist '("conf" . "src conf-unix"))

;If any programming language mode starts (prog-mode), enable rainbow mode
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;Projectile key-bindings can be found with C-c p (as I have set the projectile-command-map below)
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap ;Allows to easily create a key-binding for the projectile package
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects")
    (setq projectile-project-search-path '("~/Projects")))
  (setq projectile-switch-project-action #'projectile-dired))

;After C-c p p and hitting M-o there are many actions, that can be invoked on a project
(use-package counsel-projectile
  :config (counsel-projectile-mode))

(use-package magit
  :custom
  ;; display diff in the same window
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; show nav at the top of each project file
(defun mma/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . mma/lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :init
  :custom (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)

(use-package company
  :after lsp-mode
  :hook (prog-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
  
(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package python-mode
  :ensure nil
  :hook
  (python-mode . lsp-deferred)
  :custom
  (python-shell-interpreter "/usr/bin/python3.10"))

;; virtual envirnoment management
(use-package pyvenv
  :ensure t
  :config
  (pyvenv-mode 1))

;; force lsp-mode to run global pylsp server each time
(setq lsp-pylsp-server-command "pylsp")
;; but to use local python interpreter from the selected .venv
(setq lsp-pylsp-python-executable-cmd "python")
