emacs-config/config.org
** Auto Tangle Configuration Files

#+begin_src emacs-lisp
;update dynamically given emacs *.el file on save to the path specified in the #+PROPERTY at the beginning of the file
(defun mma/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name mma/org-config-path)) 
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mma/org-babel-tangle-config)))
#+end_src

* Other Applications
** Some App
I can have not only my emacs config in one org-mode file, but also other configuration files (other *.ini files in my system). Below I am using the ~:tangle~ parameter with path where the code block should be tangled + by ~mkdrip yes~ I am saying: "even if there is no such path as the path specified in the ~:tangle~ parameter, please create it for me (even if you have to create parent directories).

#+begin_src conf-unix :tangle no
[section one]
val1=32
val2=45

[section two]
blah = ...
boom = "bum"
shaka = "laka"
#+end_src

* System Configuration
This section contains list of all the system (Ubuntu) packages, that I am using. 
** at first

#+begin_src shell :tangle no
sudo apt-get install software-properties-common -y
sudo apt-get install curl
sudo apt-get install vim
sudo apt-get install git
sudo apt-get install gnome-tweaks
#+end_src

** latex

#+begin_src shell :tangle no
sudo apt-get install texlive-science
sudo apt-get install texlive-latex-extra
#+end_src

** emacs

#+begin_src shell :tangle no
sudo apt-get install emacs
sudo apt-get install fonts-firacode
sudo apt-get install elpa-counsel
sudo apt-get install ripgrep
#+end_src

Also (for my emacs configuration) it is important to install "Cantarell" font. Probably there is no apt-like package for it, but it can be downloaded from [[https://fonts.google.com/specimen/Cantarell][here]].

** python (for version 3.11)

#+begin_src shell :tangle no
sudo apt-get install python3.11
sudo apt-get install python3.11-distutils
sudo apt-get install python3.11-venv
# make sure, that the pip is installed for the python3.10
curl -sS https://bootstrap.pypa.io/get-pip.py | python3.11
# install language server for python (for emacs)
pip3 install --upgrade pip setuptools
python3.11 -m pip install 'python-lsp-server[all]'
# install pyenv
curl https://pyenv.run | bash
#+end_src

