emacs-config/init.el

;update dynamically given emacs *.el file on save to the path specified in the #+PROPERTY at the beginning of the file
(defun mma/org-babel-tangle-config ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name mma/org-config-path)) 
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'mma/org-babel-tangle-config)))
